<template>
  <section class="container">
    <h1 class="title">
      開運 おみくじ
    </h1>
    <div class="container fortune-box" v-if="!getFortune">
      <img @click="swingAndShuffleFortuneBox" :class="swingBox" src="~/assets/omikuji_tsutsu.png">
      <span class="message"><p>みくじ箱をタップして振ってください</p></span>
      <div class="fortune-action">
        <a
          @click="drawFortune()"
          target="_blank"
          class="button--green">おみくじを引く</a>
      </div>
    </div>
    <div>
      <div v-if="getFortune" class="fortune-paper">
        <div class="fortune-paper-inner">
          <div class="fortune-paper-top">
            <h1 class="fortune-title">{{ getFortune }}</h1>
          </div>
          <div class="fortune-paper-desc">
            <div class="fortune-paper-desc-row">
              <div :class="getRowClass(value)" v-for="(value, key) in getFortuneDetail(0)">
                <h2 class="fortune-row-title">
                  {{ key }}
                </h2>
                <h2 class="fortune-row-desc">
                  {{ value }}
                </h2>
              </div>
            </div>
            <div class="fortune-paper-desc-row">
              <div :class="getRowClass(value)" v-for="(value, key) in getFortuneDetail(1)">
                <h2 class="fortune-row-title">
                  {{ key }}
                </h2>
                <h2 class="fortune-row-desc">
                  {{ value }}
                </h2>
              </div>
              </div>
            </div>
          </div>
        </div>
        <div v-if="getFortune" class="container fortune-action">
          <a
            @click="reset()"
            target="_blank"
            class="button--green">もう一度</a>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import lodash from 'lodash'

export default {
  data () {
    const luck = ["大吉", "中吉", "吉", "小吉", "末吉"]
    const luckDetail = {
      "全て": {
        "願望": ["叶うが時間がかかる", "少し時間がかかるが叶う", "金銭其他万事心任です 安心油断大敵", "出来かねるように危惧を覚えるが後に整う","改めかえてすれば望みごと叶い喜び多し",
                  "思いがけぬ人の助けがありて叶うことあり", "思うままだが油断すれば叶わず ", "全然吉運に向いて 思わず早く叶う", "無理に事をなすは悪し 時をまてば叶う", "早く叶いて喜びあり 人を敬いてせよ",
                  "にわかに事なきを得んとすれば災あり", "叶いにくい あせるな"],
        "失物": ["見つかる 近くを探せ", "家の中を探せ", "出る 人手に渡らず", "物陰にあり", "出る", "出る 近いところ", "出る 遠いところ", "出る 高いところ",  "出る 低いところ",
                 "必ず出る 早く探せ", "遅くても出る", "出にくい", "出るが役にたたず"],
        "争事": ["勝つ 静かにせよ", "仲介が丸く収める", "勝ちづらい あせるな", "騒がずとも自ずと勝つ", "勝つがひかえるが吉", "慎重に事を進めるがよし", "自己を戒めよ 勝つ",
                "先に言いと負ける", "ひかえるがよい", "勝つとも損あり", "時を待たねば勝てず", "末は勝つが今は凶"],
        "転居": ["よろしい", "西が吉", "東が吉", "確認せよ", "急ぐな", "さわりなきけれども待て", "さわぐな", "よろしからず", "さわらぬ方がよし", "ゆっくりして吉", "十分ならず"],
        "縁談": ["叶う あまり返事をなびかすと悪い", "迷わず進めてよし", "首尾よし思わず早く調う安心せよ", "思うに任す 高ぶりて破る恐れあり", "あせるな", "急ぐな",
                 "できるところを短気のために破れることあり", "あせらず静かにしていて思うようになる", "話多し よく考えよ", "途方に暮れて迷うことあり見定めよ",
                 "相手の話をよく聞き 自己主張をおさえよ", "他人の口舌に惑わされるな", "叶うとも遅し　騒げば破れる"],
        "恋愛": ["未来に幸福あり", "近くがよい", "あいしぬけ", "お互いを思いやれ", "今の人が最上 まような", "ためらわず 告白せよ", "誠意を示すことが大事", 
                 "愛を捧げよ 幸福あり", "将来幸福になる", "この人となら幸福あり", "時間がかかる", "待て 将来が吉", "思うだけでは駄目", "今はまだ駄目"],
        "出産": ["待望の暗示あり", "安心せよ 安産", "安心せよ 難なし", "さわりなし 男児生る", "さわりなし 女児生る", "安定すれば安産", "安し ",
                 "産前を用心すれば安産", "安し 後用心せよ"],
        "学問": ["努力すればよろし", "結果が出る", "安心して勉学せよ", "時期は今全力を尽くせ", "よし 安心して勉学せよ", "自己の甘えを捨てよ",
                 "自己の甘えを断ち 目標を定めよ", "早めに目標を立てて全力を尽くせ", "早めの決心が大事"],
        "待人": ["くる", "くる 音信あり", "たよりなし くる", "さわりなく くる", "きます", "遅いけれどもくる", "急ぐな", "来れど 遅い", "さわりあり 来らず ", "来てもおそい"],
        "旅行": ["よい", "遠くがよい", "思い切ってでよ 吉", "よろし さわりなし", "行く先 利益あり", "早く行くが利", "利益あり 行きて吉", "近場がよい", "遠方に行き利益有", "出発は吉日がよい",
                 "東がよい", "西がよい", "急がぬ方がよい", "ひかえよ", "盗難に用心せよ", "十分ならず"],
        "病気": ["安心せよ 治る", "早く治る", "精神の安定第一", "医師を選べ 治る", "時間がかかるが治る", "弱気ならなければ治る", "心を強く持てば治る", "心穏やかにすれば治る", "日頃を気をつけよ", "心長く保養せよ", "信神すればよし"],
      },
      "大吉": {
        "願望": ["叶うが時間がかかる", "少し時間がかかるが叶う", "金銭其他万事心任です 安心油断大敵", "出来かねるように危惧を覚えるが後に整う","改めかえてすれば望みごと叶い喜び多し",
                  "思いがけぬ人の助けがありて叶うことあり", "思うままだが油断すれば叶わず ", "全然吉運に向いて 思わず早く叶う", "無理に事をなすは悪し 時をまてば叶う", "早く叶いて喜びあり 人を敬いてせよ"],
        "失物": ["見つかる 近くを探せ", "家の中を探せ", "出る 人手に渡らず", "物陰にあり", "出る", "出る 近いところ", "出る 遠いところ", "出る 高いところ",  "出る 低いところ",
                 "必ず出る 早く探せ", "早く探すが吉", "遅くても出る"],
        "争事": ["勝つ 静かにせよ", "仲介が丸く収める", "勝ちづらい あせるな", "騒がずとも自ずと勝つ", "勝つがひかえるが吉", "慎重に事を進めるがよし", "自己を戒めよ 勝つ",
                "先に言いと負ける", "ひかえるがよい"],
        "転居": ["よろしい", "西が吉", "東が吉", "確認せよ", "さわりなきけれども待て", "さわぐな",  "さわらぬ方がよし", "ゆっくりして吉"],
        "縁談": ["叶う あまり返事をなびかすと悪い", "迷わず進めてよし", "首尾よし思わず早く調う安心せよ", "思うに任す 高ぶりて破る恐れあり", "あせるな", "急ぐな",
                 "できるところを短気のために破れることあり", "あせらず静かにしていて思うようになる", "話多し よく考えよ", "途方に暮れて迷うことあり見定めよ",
                 "相手の話をよく聞き 自己主張をおさえよ"],
        "恋愛": ["未来に幸福あり", "近くがよい", "あいしぬけ", "お互いを思いやれ", "今の人が最上 まような", "ためらわず 告白せよ", "誠意を示すことが大事", 
                 "愛を捧げよ 幸福あり", "将来幸福になる", "この人となら幸福あり"],
        "出産": ["待望の暗示あり", "安心せよ 安産", "安心せよ 難なし", "さわりなし 男児生る", "さわりなし 女児生る", "安定すれば安産", "安し ",
                 "産前を用心すれば安産", "安し 後用心せよ"],
        "学問": ["努力すればよろし", "結果が出る", "安心して勉学せよ", "時期は今全力を尽くせ", "よし 安心して勉学せよ", "自己の甘えを捨てよ",
                 "自己の甘えを断ち 目標を定めよ", "早めに目標を立てて全力を尽くせ", "早めの決心が大事"],
        "待人": ["くる", "くる 音信あり", "たよりなし くる", "さわりなく くる", "きます", "遅いけれどもくる", "急ぐな"],
        "旅行": ["よい", "遠くがよい", "思い切ってでよ 吉", "よろし さわりなし", "行く先 利益あり", "早く行くが利", "利益あり 行きて吉", "近場がよい", "遠方に行き利益有", "出発は吉日がよい",
                 "東がよい", "西がよい", "急がぬ方がよい", "ひかえよ"],
        "病気": ["安心せよ 治る", "早く治る", "精神の安定第一", "医師を選べ 治る", "時間がかかるが治る", "弱気ならなければ治る", "心を強く持てば治る", "心穏やかにすれば治る", "日頃を気をつけよ", "心長く保養せよ", "信神すればよし"],
      },
      "中吉": {
        "願望": ["叶うが時間がかかる", "少し時間がかかるが叶う", "出来かねるように危惧を覚えるが後に整う","改めかえてすれば望みごと叶い喜び多し",
                 "思うままだが油断すれば叶わず ", "全然吉運に向いて 思わず早く叶う", "無理に事をなすは悪し 時をまてば叶う", "早く叶いて喜びあり 人を敬いてせよ",
                  "にわかに事なきを得んとすれば災あり"],
        "失物": ["出る 人手に渡らず", "物陰にあり", "出る", "出る 近いところ", "出る 遠いところ", "出る 高いところ",  "出る 低いところ",
                 "必ず出る 早く探せ", "遅くても出る", "出るが役にたたず"],
        "争事": ["勝つ 静かにせよ", "仲介が丸く収める", "勝ちづらい あせるな", "勝つがひかえるが吉", "慎重に事を進めるがよし", "自己を戒めよ 勝つ",
                "先に言いと負ける", "ひかえるがよい", "勝つとも損あり", "末は勝つが今は凶"],
        "転居": ["よろしい", "西が吉", "東が吉", "確認せよ", "急ぐな", "さわりなきけれども待て", "さわぐな", "よろしからず", "さわらぬ方がよし", "ゆっくりして吉", "十分ならず"],
        "縁談": ["叶う あまり返事をなびかすと悪い", "迷わず進めてよし", "首尾よし思わず早く調う安心せよ", "あせるな",
                 "あせらず静かにしていて思うようになる", "話多し よく考えよ", "途方に暮れて迷うことあり見定めよ",
                 "相手の話をよく聞き 自己主張をおさえよ", "他人の口舌に惑わされるな"],
        "恋愛": ["未来に幸福あり", "近くがよい", "あいしぬけ", "お互いを思いやれ", "今の人が最上 まような", "ためらわず 告白せよ", "誠意を示すことが大事",
                 "愛を捧げよ 幸福あり", "将来幸福になる", "この人となら幸福あり", "待て 将来が吉", "思うだけでは駄目"],
        "出産": ["待望の暗示あり", "安心せよ 安産", "安心せよ 難なし", "さわりなし 男児生る", "さわりなし 女児生る", "安定すれば安産", "安し ",
                 "産前を用心すれば安産", "安し 後用心せよ"],
        "学問": ["努力すればよろし", "結果が出る", "安心して勉学せよ", "時期は今全力を尽くせ", "よし 安心して勉学せよ", "自己の甘えを捨てよ",
                 "自己の甘えを断ち 目標を定めよ", "早めに目標を立てて全力を尽くせ", "早めの決心が大事"],
        "待人": ["くる", "くる 音信あり", "たよりなし くる", "さわりなく くる", "きます", "遅いけれどもくる", "急ぐな", "来れど 遅い", "来てもおそい"],
        "旅行": ["よい", "遠くがよい", "思い切ってでよ 吉", "よろし さわりなし", "行く先 利益あり", "早く行くが利", "利益あり 行きて吉", "近場がよい", "遠方に行き利益有", "出発は吉日がよい",
                 "東がよい", "西がよい", "急がぬ方がよい", "十分ならず"],
        "病気": ["安心せよ 治る", "早く治る", "精神の安定第一", "医師を選べ 治る", "時間がかかるが治る", "弱気ならなければ治る", "心を強く持てば治る", "心穏やかにすれば治る",
                "日頃を気をつけよ", "心長く保養せよ", "信神すればよし"],
      },
      "吉": {
        "願望": ["叶うが時間がかかる", "少し時間がかかるが叶う",  "出来かねるように危惧を覚えるが後に整う","改めかえてすれば望みごと叶い喜び多し",
                  "思いがけぬ人の助けがありて叶うことあり", "思うままだが油断すれば叶わず ", "全然吉運に向いて 思わず早く叶う", "無理に事をなすは悪し 時をまてば叶う", "早く叶いて喜びあり 人を敬いてせよ",
                  "にわかに事なきを得んとすれば災あり" ],
        "失物": ["家の中を探せ", "出る 人手に渡らず", "物陰にあり", "出る", "出る 近いところ", "出る 遠いところ", "出る 高いところ",  "出る 低いところ",
                 "必ず出る 早く探せ", "遅くても出る", "出にくい", "出るが役にたたず"],
        "争事": ["勝つ 静かにせよ", "仲介が丸く収める", "勝ちづらい あせるな", "騒がずとも自ずと勝つ", "勝つがひかえるが吉", "慎重に事を進めるがよし", "自己を戒めよ 勝つ",
                "先に言いと負ける", "ひかえるがよい", "勝つとも損あり", "時を待たねば勝てず", "末は勝つが今は凶"],
        "転居": ["よろしい", "西が吉", "東が吉", "確認せよ", "急ぐな", "さわりなきけれども待て", "さわぐな", "よろしからず", "さわらぬ方がよし", "ゆっくりして吉", "十分ならず"],
        "縁談": ["叶う あまり返事をなびかすと悪い", "迷わず進めてよし", "首尾よし思わず早く調う安心せよ", "思うに任す 高ぶりて破る恐れあり", "あせるな", "急ぐな",
                 "できるところを短気のために破れることあり", "あせらず静かにしていて思うようになる", "話多し よく考えよ", "途方に暮れて迷うことあり見定めよ",
                 "相手の話をよく聞き 自己主張をおさえよ", "他人の口舌に惑わされるな", "叶うとも遅し　騒げば破れる"],
        "恋愛": ["未来に幸福あり", "近くがよい", "あいしぬけ", "お互いを思いやれ", "今の人が最上 まような", "ためらわず 告白せよ", "誠意を示すことが大事", 
                 "愛を捧げよ 幸福あり", "将来幸福になる", "この人となら幸福あり", "時間がかかる", "待て 将来が吉", "思うだけでは駄目", "今はまだ駄目"],
        "出産": ["待望の暗示あり", "安心せよ 安産", "安心せよ 難なし", "さわりなし 男児生る", "さわりなし 女児生る", "安定すれば安産", "安し ",
                 "産前を用心すれば安産", "安し 後用心せよ"],
        "学問": ["努力すればよろし", "結果が出る", "安心して勉学せよ", "時期は今全力を尽くせ", "よし 安心して勉学せよ", "自己の甘えを捨てよ",
                 "自己の甘えを断ち 目標を定めよ", "早めに目標を立てて全力を尽くせ", "早めの決心が大事"],
        "待人": ["くる", "くる 音信あり", "たよりなし くる", "さわりなく くる", "きます", "遅いけれどもくる", "急ぐな", "来れど 遅い", "さわりあり 来らず ", "来てもおそい"],
        "旅行": ["よい", "遠くがよい", "思い切ってでよ 吉", "よろし さわりなし", "行く先 利益あり", "早く行くが利", "利益あり 行きて吉", "近場がよい", "遠方に行き利益有", "出発は吉日がよい",
                 "東がよい", "西がよい", "急がぬ方がよい", "ひかえよ", "盗難に用心せよ", "十分ならず"],
        "病気": ["安心せよ 治る", "早く治る", "精神の安定第一", "医師を選べ 治る", "時間がかかるが治る", "弱気ならなければ治る", "心を強く持てば治る", "心穏やかにすれば治る", "日頃を気をつけよ", "心長く保養せよ", "信神すればよし"],
      },
      "小吉": {
        "願望": ["叶うが時間がかかる", "少し時間がかかるが叶う", "改めかえてすれば望みごと叶い喜び多し",
                  "思いがけぬ人の助けがありて叶うことあり", "思うままだが油断すれば叶わず ", "全然吉運に向いて 思わず早く叶う", "無理に事をなすは悪し 時をまてば叶う", "早く叶いて喜びあり 人を敬いてせよ",
                  "にわかに事なきを得んとすれば災あり", "叶いにくい あせるな"],
        "失物": ["家の中を探せ", "出る 人手に渡らず", "物陰にあり", "出る", "出る 近いところ", "出る 遠いところ", "出る 高いところ",  "出る 低いところ",
                 "遅くても出る", "出にくい", "出るが役にたたず", "出づらい よく探せ"],
        "争事": ["勝ちづらい あせるな", "騒がずとも自ずと勝つ", "勝つがひかえるが吉", "慎重に事を進めるがよし", "自己を戒めよ 勝つ",
                 "先に言いと負ける", "ひかえるがよい", "勝つとも損あり", "時を待たねば勝てず", "末は勝つが今は凶"],
        "転居": ["西が吉", "東が吉", "確認せよ", "急ぐな", "さわりなきけれども待て", "さわぐな", "よろしからず", "さわらぬ方がよし", "ゆっくりして吉", "十分ならず"],
        "縁談": ["叶う あまり返事をなびかすと悪い", "迷わず進めてよし", "首尾よし思わず早く調う安心せよ", "思うに任す 高ぶりて破る恐れあり", "あせるな", "急ぐな",
                 "できるところを短気のために破れることあり", "あせらず静かにしていて思うようになる", "話多し よく考えよ", "途方に暮れて迷うことあり見定めよ",
                 "相手の話をよく聞き 自己主張をおさえよ", "他人の口舌に惑わされるな", "叶うとも遅し　騒げば破れる"],
        "恋愛": ["未来に幸福あり", "近くがよい", "あいしぬけ", "お互いを思いやれ", "今の人が最上 まような", "ためらわず 告白せよ", "誠意を示すことが大事", 
                 "愛を捧げよ 幸福あり", "将来幸福になる", "この人となら幸福あり", "時間がかかる", "待て 将来が吉", "思うだけでは駄目", "今はまだ駄目"],
        "出産": ["待望の暗示あり", "安心せよ 安産", "安心せよ 難なし", "さわりなし 男児生る", "さわりなし 女児生る", "安定すれば安産", "安し ",
                 "産前を用心すれば安産", "安し 後用心せよ"],
        "学問": ["努力すればよろし", "結果が出る", "安心して勉学せよ", "時期は今全力を尽くせ", "よし 安心して勉学せよ", "自己の甘えを捨てよ",
                 "自己の甘えを断ち 目標を定めよ", "早めに目標を立てて全力を尽くせ", "早めの決心が大事"],
        "待人": ["くる 音信あり", "たよりなし くる", "さわりなく くる", "遅いけれどもくる", "急ぐな", "来れど 遅い", "さわりあり 来らず ", "来てもおそい"],
        "旅行": ["よい", "遠くがよい", "思い切ってでよ 吉", "よろし さわりなし", "行く先 利益あり", "早く行くが利", "利益あり 行きて吉", "近場がよい", "遠方に行き利益有", "出発は吉日がよい",
                 "東がよい", "西がよい", "急がぬ方がよい", "ひかえよ", "盗難に用心せよ", "十分ならず"],
        "病気": ["早く治る", "精神の安定第一", "医師を選べ 治る", "時間がかかるが治る", "弱気ならなければ治る", "心を強く持てば治る", "心穏やかにすれば治る", "日頃を気をつけよ", "心長く保養せよ", "信神すればよし"],
      },
      "末吉": {
        "願望": ["思いがけぬ人の助けがありて叶うことあり", "思うままだが油断すれば叶わず ", "全然吉運に向いて 思わず早く叶う", "無理に事をなすは悪し 時をまてば叶う", "早く叶いて喜びあり 人を敬いてせよ",
                  "にわかに事なきを得んとすれば災あり", "叶いにくい あせるな"],
        "失物": ["出る 人手に渡らず", "物陰にあり", "出る 近いところ", "出る 遠いところ", "出る 高いところ", "出る 低いところ",
                 "遅くても出る", "出にくい", "出るが役にたたず"],
        "争事": ["勝ちづらい あせるな", "騒がずとも自ずと勝つ", "勝つがひかえるが吉", "慎重に事を進めるがよし", "自己を戒めよ 勝つ",
                "先に言いと負ける", "ひかえるがよい", "勝つとも損あり", "時を待たねば勝てず", "末は勝つが今は凶"],
        "転居": ["西が吉", "東が吉", "確認せよ", "急ぐな", "さわりなきけれども待て", "さわぐな", "よろしからず", "さわらぬ方がよし", "ゆっくりして吉", "十分ならず"],
        "縁談": [ "思うに任す 高ぶりて破る恐れあり", "あせるな", "急ぐな",
                 "できるところを短気のために破れることあり", "あせらず静かにしていて思うようになる", "話多し よく考えよ", "途方に暮れて迷うことあり見定めよ",
                 "相手の話をよく聞き 自己主張をおさえよ", "他人の口舌に惑わされるな", "叶うとも遅し　騒げば破れる"],
        "恋愛": ["未来に幸福あり", "近くがよい", "あいしぬけ", "お互いを思いやれ", "ためらわず 告白せよ", "誠意を示すことが大事", 
                 "愛を捧げよ 幸福あり", "この人となら幸福あり", "時間がかかる", "待て 将来が吉", "思うだけでは駄目", "今はまだ駄目"],
        "出産": ["安心せよ 安産", "さわりなし 男児生る", "さわりなし 女児生る", "安定すれば安産", "安し ",
                 "産前を用心すれば安産", "安し 後用心せよ", "安し 日頃を気をつけよ"],
        "学問": ["努力すればよろし", "安心して勉学せよ", "時期は今全力を尽くせ", "よし 安心して勉学せよ", "自己の甘えを捨てよ",
                 "自己の甘えを断ち 目標を定めよ", "早めに目標を立てて全力を尽くせ", "早めの決心が大事"],
        "待人": ["さわりなく くる", "きます", "遅いけれどもくる", "急ぐな", "来れど 遅い", "さわりあり 来らず", "来てもおそい"],
        "旅行": ["遠くがよい", "思い切ってでよ 吉", "よろし さわりなし", "行く先 利益あり", "早く行くが利", "利益あり 行きて吉", "近場がよい", "出発は吉日がよい",
                 "東がよい", "西がよい", "急がぬ方がよい", "ひかえよ", "盗難に用心せよ", "十分ならず"],
        "病気": ["精神の安定第一", "医師を選べ 治る", "時間がかかるが治る", "弱気ならなければ治る", "心を強く持てば治る", "心穏やかにすれば治る", "日頃を気をつけよ", "心長く保養せよ", "信神すればよし"],
      },
    }
    return {
      luck: luck,
      luckDetail: luckDetail,
      fortune: "",
      fortuneDetail: {},
      swingBox: "",
    }
  },
  created: function () {
    this.shuffleFortuneBox()
  },
  computed: {
    getFortune() {
      return this.fortune
    },
  },
  methods: {
    swing() {
      this.swingBox = "swing"
      setTimeout(this.swingReset, 2000)
    },
    swingReset() {
      this.swingBox = ""
    },
    getRowClass(desctription) {
      var cls = ["row"]
      if (desctription.length >= 12) {
        cls.push("wide")
      }
      return cls
    },
    swingAndShuffleFortuneBox() {
      this.swing()
      this.shuffleFortuneBox()
    },
    shuffleFortuneBox() {
      this.luck = lodash.shuffle(this.luck)
      for (var key in this.luckDetail) {
        for (var dkey in this.luckDetail[key]) {
          this.luckDetail[key][dkey] = lodash.shuffle(this.luckDetail[key][dkey])
        }
      }
    },
    drawFortune() {
      this.fortune = this.luck[0]
      for (var key in this.luckDetail[this.fortune]) {
        this.fortuneDetail[key] = this.luckDetail[this.fortune][key][0]
      }
    },
    getFortuneDetail(rowIndex) {
      const keys = [
          ["願望", "待人", "失物", "旅行", "学問"],
          ["争事", "恋愛", "転居", "出産", "縁談"]
        ]
      var detail = {}
      for (let key of keys[rowIndex]) {
        detail[key] = this.fortuneDetail[key]
      }
      return detail
    },
    reset() {
      this.fortune = ""
      this.fortuneDetail = {}
      this.shuffleFortuneBox()
    }
  }
}
</script>

<style>
.container {
  display: flex;
  flex-direction:column;
  justify-content: center;
  align-items: center;
}

.swing {
        animation-name: swing;
        animation-duration: 2s;
        animation-delay: .45s;
}

@-webkit-keyframes swing {
    0%,100% { 
        -webkit-transform-origin: bottom center; 
    }
    10% { -webkit-transform: rotate(-15deg); }  
    20% { -webkit-transform: rotate(10deg); }
    30% { -webkit-transform: rotate(-5deg); }   
    40% { -webkit-transform: rotate(5deg); }    
    50% { -webkit-transform: rotate(-3deg); }

    60% { -webkit-transform: rotate(2deg); }
    70% { -webkit-transform: rotate(-2deg); }
    80% { -webkit-transform: rotate(1deg); }
    90% { -webkit-transform: rotate(-1deg); }
    100% { -webkit-transform: rotate(0deg); }
}

.fortune-paper {
  display: flex;
  height: 600px;
  width: 230px;
  border: 3px solid red;
  margin: 10px;
  animation-name: open;
  animation-duration: 2s;
}

@-webkit-keyframes open {
  0% {
    opacity: 0;
  }
  100% {
    opacity: 1;
  }
}

.fortune-paper-inner {
  margin: 10px;
  width: 210px;
  border: 1px solid red;
}

.fortune-paper-top {
  display: flex;
  align-items: center;
  height: 60px;
  border-bottom: 1px solid red;
  justify-content: center;
}

.fortune-paper-desc {
}

.fortune-paper-desc .fortune-paper-desc-row:first-child {
  border-bottom: 1px solid red;
}

.fortune-paper-desc-row {
  display: flex;
  display : -webkit-flex;
  height: 248px;
  flex-direction: row-reverse;
  justify-content: center;
  align-items: top;
  flex-shrink: 1;
  margin: 5px;
}

.row {
  display: flex;
  flex-basis: 40px;
  flex-shrink: 1;
  flex-direction: column;
  padding-top: 3px;
}

.wide {
  flex-basis: 65px;
}

.fortune-row-title {
  height: 40px;
}

.fortune-row-desc {
  height: 200px;
}

.fortune-action {
}

h1 {
  font-family: "游明朝", YuMincho, "ヒラギノ明朝 ProN W3", "Hiragino Mincho ProN", "HG明朝E", "ＭＳ Ｐ明朝", "ＭＳ 明朝", serif;
  color: red;
  font-size: 32px;
  letter-spacing: 1em;
  text-indent: 1em;
}

h2 {
  color: #555555;
  font-family: "游明朝", YuMincho, "ヒラギノ明朝 ProN W3", "Hiragino Mincho ProN", "HG明朝E", "ＭＳ Ｐ明朝", "ＭＳ 明朝", serif;
  -webkit-font-feature-settings: 'pkna';
  font-feature-settings: 'pkna';
  font-size: 17px;
  line-height: 1.5;
  letter-spacing: 0.03em;
  -webkit-writing-mode: vertical-rl;
  -ms-writing-mode: tb-rl;
  writing-mode: vertical-rl;
}

img {
  height: 330px;
  margin: 20px;
}

h1.title {
  font-family: 'Quicksand', 'Source Sans Pro', -apple-system, BlinkMacSystemFont,
    'Segoe UI', Roboto, 'Helvetica Neue', Arial, sans-serif;
  display: block;
  font-weight: 300;
  font-size: 40px;
  color: red;
  letter-spacing: 1px;
  text-indent: 1px;
  margin-top: 10px;
}

.fortune-box {
  display: flex;
}

.message {
  font-size: 16px;
  margin: 10px;
  color: #555555;
}
</style>
